tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendDateInput(const char* label, const char* name, std::uint32_t seconds) {
    char date[16]{};
    formatDate(seconds >= kMinFilterDateSeconds ? seconds : 0, date, sizeof(date));
    sendFmt("<label class='field'><span>%s</span><input type='date' name='%s' value='%s'></label>",
            label,
            name,
            date);
}

void sendCalibrationTargetInput(std::size_t index, std::uint32_t ml) {
    char value[16]{};
    char name[16]{};
    formatLiterValue(ml, value, sizeof(value));
    std::snprintf(name, sizeof(name), "target%uL", static_cast<unsigned>(index + 1));
    sendFmt("<label class='field'><span>候选容量 %u（L）</span><input name='%s' value='%s'><small class='hint'>0 表示不启用</small></label>",
            static_cast<unsigned>(index + 1),
            name,
            value);
}

void sendCheckbox(const char* label, const char* name, bool checked) {
    sendFmt("<label class='check-field'><span class='check-title'>%s</span><span class='check-line'><input type='checkbox' name='%s' value='1'%s>启用</span></label>",
            label,
            name,
            checked ? " checked" : "");
}

void handleFaucetPage() {
    if (!sendPageStart("出水龙头")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const AppSnapshot snapshot = g_context.app->snapshot();
    char currentPreset[16]{};
    std::snprintf(currentPreset, sizeof(currentPreset), "%u", static_cast<unsigned>(snapshot.water.selectedPreset + 1));
    char targetValue[24]{};
    if (snapshot.water.mode == WaterMode::Time) {
        std::snprintf(targetValue, sizeof(targetValue), "%lu 秒", static_cast<unsigned long>(snapshot.water.targetValue));
    } else {
        formatLiters(snapshot.water.targetValue, targetValue, sizeof(targetValue));
    }
    char today[24]{};
    char week[24]{};
    char month[24]{};
    char total[24]{};
    formatLiters(snapshot.statistics.todayMl, today, sizeof(today));
    formatLiters(snapshot.statistics.weekMl, week, sizeof(week));
    formatLiters(snapshot.statistics.monthMl, month, sizeof(month));
    formatLiters(snapshot.statistics.totalMl, total, sizeof(total));

    Esp32BaseWeb::sendChunk("<h2>状态</h2><div class='metric-grid'>");
    sendMetricCard("运行状态", stateText(snapshot.water.state));
    sendMetricCard("当前预设", currentPreset);
    sendMetricCard("目标值", targetValue);
    sendMetricCard("今日用水", today);
    Esp32BaseWeb::sendChunk("</div><h2>统计</h2><div class='metric-grid'>");
    sendMetricCard("今日", today);
    sendMetricCard("本周", week);
    sendMetricCard("本月", month);
    sendMetricCard("总累计", total);
    Esp32BaseWeb::sendChunk("</div><h2>滤芯</h2><div class='filter-cards'>");
    bool anyFilter = false;
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        if (!filter.enabled) {
            continue;
        }
        anyFilter = true;
        const std::uint32_t usedDays =
            filter.startTime >= kMinFilterDateSeconds ? g_context.filters->usedDays(i, g_context.nowSeconds()) : 0;
        char life[32]{};
        formatLifeRange(filter, life, sizeof(life));
        char usedFlow[24]{};
        formatLiters(filter.usedMl, usedFlow, sizeof(usedFlow));
        const std::uint32_t progress = filterProgressPercent(filter, usedDays);
        Esp32BaseWeb::sendChunk("<section class='filter-card'><div class='filter-head'><strong>");
        Esp32BaseWeb::writeHtmlEscaped(filter.name);
        sendFmt("</strong><span class='status-pill'>%s</span></div>",
                filterDisplayStatusText(filter, usedDays));
        if (filter.recommendDays > 0) {
            sendFmt("<div class='progress'><span style='width:%lu%%'></span></div>",
                    static_cast<unsigned long>(progress));
            sendFmt("<div class='filter-meta'><span>已用 %lu 天</span><span>寿命 %s</span><span>流量 %s</span><span>进度 %lu%%</span></div></section>",
                    static_cast<unsigned long>(usedDays),
                    life,
                    usedFlow,
                    static_cast<unsigned long>(progress));
        } else {
            Esp32BaseWeb::sendChunk("<p class='hint'>未设置周期</p>");
            sendFmt("<div class='filter-meta'><span>已用 %lu 天</span><span>寿命 %s</span><span>流量 %s</span></div></section>",
                    static_cast<unsigned long>(usedDays),
                    life,
                    usedFlow);
        }
    }
    if (!anyFilter) {
        Esp32BaseWeb::sendChunk("<section class='filter-card muted'>当前没有启用的滤芯。</section>");
    }
    Esp32BaseWeb::sendChunk("</div>");
    sendPageEnd();
}

void handleConfigPage() {
    if (!sendPageStart("出水配置")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const SystemConfig& config = *g_context.config;
    Esp32BaseWeb::sendChunk("<h2>配置</h2><form method='post' action='/api/faucet/config' onsubmit='return once(this)'>"
                            "<section class='panel'><h3>安全限制</h3><div class='grid'>");
    sendTextInput("二次确认超时（秒）", "confirmTimeoutSec", config.confirmTimeoutSec);
    sendTextInput("最长出水时间（秒）", "maxOutTimeSec", config.maxOutTimeSec);
    sendVolumeInput("最大出水量（ml）", "maxOutVolumeMl", config.maxOutVolumeMl);
    sendTextInput("超量保护比例（%）", "overflowPercent", config.overflowPercent);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>流量保护</h3><div class='grid'>");
    sendTextInput("无流量超时（秒）", "noFlowTimeoutSec", config.noFlowTimeoutSec);
    sendTextInput("高流量阈值（ml/min）", "highFlowMlPerMin", config.highFlowMlPerMin);
    sendTextInput("高流量持续时间（秒）", "highFlowDurationSec", config.highFlowDurationSec);
    sendTextInput("暂停超时（秒）", "pauseTimeoutSec", config.pauseTimeoutSec);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>电磁阀</h3><div class='grid'>");
    sendTextInput("电磁阀全功率时间（秒）", "valveFullPowerSec", config.valveFullPowerSec);
    sendTextInput("电磁阀保持占空比（%）", "valveHoldDutyPercent", config.valveHoldDutyPercent);
    Esp32BaseWeb::sendChunk("</div></section><section class='panel'><h3>本地交互</h3><div class='grid'>");
    sendTextInput("OLED 熄屏时间（秒）", "oledSleepSec", config.oledSleepSec);
    sendCheckbox("蜂鸣器", "beepEnabled", config.beepEnabled);
    Esp32BaseWeb::sendChunk("</div></section><div class='form-actions'><input type='submit' value='保存'></div></form>");
    sendPageEnd();
}

