tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleFiltersPage() {
    if (!sendPageStart("滤芯状态")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const std::uint32_t now = g_context.nowSeconds();
    Esp32BaseWeb::sendChunk("<h2>滤芯</h2><table><tr><th>名称</th><th>启用</th><th>已用天数</th><th>已用流量</th><th>寿命</th><th>状态</th><th>操作</th></tr>");
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        const std::uint32_t usedDays = filter.startTime >= kMinFilterDateSeconds ? g_context.filters->usedDays(i, now) : 0;
        char life[32]{};
        formatLifeRange(filter, life, sizeof(life));
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(filter.name);
        sendFmt("</td><td>%s</td><td>%lu</td><td>",
                filter.enabled ? "启用" : "停用",
                static_cast<unsigned long>(usedDays));
        sendLiters(filter.usedMl);
        sendFmt("</td><td>%s", life);
        Esp32BaseWeb::sendChunk(" / ");
        if (filter.lifeMl > 0) {
            sendLiters(filter.lifeMl);
        } else {
            Esp32BaseWeb::sendChunk("未设置流量");
        }
        sendFmt("</td><td>%s</td><td><div class='form-actions'><a href='/faucet/filters/edit?index=%u'>设置</a>",
                filterDisplayStatusText(filter, usedDays),
                static_cast<unsigned>(i));
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/filters/reset' "
                                "onsubmit=\"return confirm('确认重置滤芯？')&&once(this)\">");
        sendFmt("<input type='hidden' name='index' value='%u'>", static_cast<unsigned>(i));
        Esp32BaseWeb::sendChunk("<input class='secondary' type='submit' value='重置'></form></div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table>");
    sendPageEnd();
}

void handleFilterEditPage() {
    if (!sendPageStart("滤芯设置")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }

    char text[24]{};
    std::uint32_t index = 0;
    if (!getParam("index", text, sizeof(text)) || !parseU32(text, index) || index >= kFilterCount) {
        Esp32BaseWeb::sendChunk("<h2>滤芯设置</h2><section class='panel'><p>滤芯编号无效。</p>"
                                "<p><a href='/faucet/filters'>返回滤芯列表</a></p></section>");
        sendPageEnd();
        return;
    }

    const FilterRecord& filter = g_context.filters->record(index);
    sendFmt("<h2>第 %u 级滤芯设置</h2>"
            "<section class='panel'><form method='post' action='/api/faucet/filters' onsubmit='return once(this)'>"
            "<input type='hidden' name='index' value='%u'><div class='grid'>",
            static_cast<unsigned>(index + 1),
            static_cast<unsigned>(index));
    sendCheckbox("启用", "enabled", filter.enabled);
    Esp32BaseWeb::sendChunk("<label class='field'><span>名称</span><input name='name' maxlength='15' value='");
    sendHtmlAttrEscaped(filter.name);
    Esp32BaseWeb::sendChunk("'><small class='hint'>最多 15 个字符</small></label>");
    sendMonthInput("建议更换周期（月）", "recommendMonths", filter.recommendDays);
    sendMonthInput("最长使用周期（月）", "maxMonths", filter.maxDays);
    sendVolumeInput("寿命流量（ml）", "lifeMl", filter.lifeMl);
    sendDateInput("上次更换日期", "startDate", filter.startTime);
    Esp32BaseWeb::sendChunk("</div><div class='form-actions'><input type='submit' value='保存'>"
                            "<a href='/faucet/filters'>取消</a></div></form></section>");
    sendPageEnd();
}

void handleCalibrationPage() {
    if (!sendPageStart("流量校准")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const SystemConfig& config = *g_context.config;
    Esp32BaseWeb::sendChunk("<h2>校准</h2><section class='panel'><h3>三段式本地校准</h3>"
                            "<p><strong>准备：</strong>在本页配置候选容量和当前每升信号数，本地长按 OK 进入校准，NEXT 选择启用容量。</p>"
                            "<p><strong>采样：</strong>本地按 OK 二次确认并开始出水，到量杯刻度后按 OK 停止采样。</p>"
                            "<p><strong>保存：</strong>至少两次采样一致后，本地按 OK 保存新系数；STOP 可随时取消并关阀。</p>"
                            "<p class='hint'>Web 端只允许查看和手动修改参数，不能远程启动出水校准。</p></section>"
                            "<form method='post' action='/api/faucet/calibration' onsubmit='return once(this)'>"
                            "<section class='panel'><h3>校准参数</h3><div class='grid'>");
    Esp32BaseWeb::sendChunk("<label class='field'><span>每升信号数（脉冲/L）</span><input name='pulsePerLiter' value='");
    sendFmt("%.1f", static_cast<double>(config.pulsePerMl * 1000.0f));
    Esp32BaseWeb::sendChunk("'><small class='hint'>内部按 pulse/ml 保存和计算</small></label>");
    for (std::size_t i = 0; i < kCalibrationTargetCount; ++i) {
        sendCalibrationTargetInput(i, config.calibrationTargetsMl[i]);
    }
    Esp32BaseWeb::sendChunk("</div></section><div class='form-actions'><input type='submit' value='保存'></div></form>");
    sendPageEnd();
}

void handleApi() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true,\"waterControl\":false}");
}

bool sendJsonBuffer(bool ok, const char* json) {
    if (!ok) {
        Esp32BaseWeb::sendJson(500, "{\"error\":\"buffer_too_small\"}");
        return false;
    }
    Esp32BaseWeb::sendJson(200, json);
    return true;
}

bool requireContext() {
    if (!g_context.config || !g_context.configStore || !g_context.app || !g_context.filters || !g_context.logs ||
        !g_context.nowSeconds) {
        Esp32BaseWeb::sendJson(503, "{\"error\":\"context_not_ready\"}");
        return false;
    }
    return true;
}

bool getParam(const char* name, char* out, std::size_t len) {
    return Esp32BaseWeb::hasParam(name) && Esp32BaseWeb::getParam(name, out, len);
}

bool parseU32(const char* text, std::uint32_t& value) {
    if (!text || !*text) {
        return false;
    }
    char* end = nullptr;
    const unsigned long parsed = std::strtoul(text, &end, 10);
    if (!end || *end != '\0' || parsed > UINT32_MAX) {
        return false;
    }
    value = static_cast<std::uint32_t>(parsed);
    return true;
}

bool isLeapYear(std::uint16_t year) {
    return (year % 4U == 0 && year % 100U != 0) || year % 400U == 0;
}

std::uint8_t daysInMonth(std::uint16_t year, std::uint8_t month) {
    static constexpr std::uint8_t days[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    if (month == 2 && isLeapYear(year)) {
        return 29;
    }
    return month >= 1 && month <= 12 ? days[month - 1] : 0;
}

std::uint32_t daysSince2000(std::uint16_t year, std::uint8_t month, std::uint8_t day) {
    static constexpr std::uint16_t kDaysBeforeMonth[] = {0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334};
    std::uint32_t days = 0;
    for (std::uint16_t y = 2000; y < year; ++y) {
        days += isLeapYear(y) ? 366UL : 365UL;
    }
    std::uint32_t value = days + kDaysBeforeMonth[month - 1] + day - 1U;
    if (month > 2 && isLeapYear(year)) {
        ++value;
    }
    return value;
}

