tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool parseDate(const char* text, std::uint32_t& seconds) {
    if (!text || !*text) {
        seconds = 0;
        return true;
    }
    unsigned year = 0;
    unsigned month = 0;
    unsigned day = 0;
    if (std::sscanf(text, "%u-%u-%u", &year, &month, &day) != 3 || year < 2020 || year > 2099 || month < 1 ||
        month > 12) {
        return false;
    }
    const std::uint8_t maxDay = daysInMonth(static_cast<std::uint16_t>(year), static_cast<std::uint8_t>(month));
    if (day < 1 || day > maxDay) {
        return false;
    }
    seconds = daysSince2000(static_cast<std::uint16_t>(year), static_cast<std::uint8_t>(month), static_cast<std::uint8_t>(day)) *
              86400UL;
    return true;
}

void formatDate(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    out[0] = '\0';
    if (seconds == 0) {
        return;
    }
    std::uint32_t day = seconds / 86400UL;
    std::uint16_t year = 2000;
    while (true) {
        const std::uint16_t yearDays = isLeapYear(year) ? 366 : 365;
        if (day < yearDays) {
            break;
        }
        day -= yearDays;
        ++year;
    }
    std::uint8_t month = 1;
    while (month <= 12) {
        const std::uint8_t monthDays = daysInMonth(year, month);
        if (day < monthDays) {
            break;
        }
        day -= monthDays;
        ++month;
    }
    std::snprintf(out, len, "%04u-%02u-%02u", static_cast<unsigned>(year), static_cast<unsigned>(month),
                  static_cast<unsigned>(day + 1));
}

bool parseFloat(const char* text, float& value) {
    if (!text || !*text) {
        return false;
    }
    char* end = nullptr;
    const float parsed = std::strtof(text, &end);
    if (!end || *end != '\0' || !std::isfinite(parsed)) {
        return false;
    }
    value = parsed;
    return true;
}

bool parseLitersToMl(const char* text, std::uint32_t& value) {
    float liters = 0.0f;
    if (!parseFloat(text, liters) || liters < 0.0f) {
        return false;
    }
    if (liters == 0.0f) {
        value = 0;
        return true;
    }
    const float ml = liters * 1000.0f;
    if (ml > static_cast<float>(UINT32_MAX)) {
        return false;
    }
    value = static_cast<std::uint32_t>(ml + 0.5f);
    return true;
}

void applyU32Param(const char* name, std::uint32_t& value) {
    char text[24]{};
    std::uint32_t parsed = 0;
    if (getParam(name, text, sizeof(text)) && parseU32(text, parsed)) {
        value = parsed;
    }
}

bool persistConfig(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        return false;
    }

    SystemConfig safe = config;
    sanitizeConfig(safe);
    if (!g_context.configStore->saveSystemConfig(safe)) {
        return false;
    }
    if (!g_context.app->applyConfig(safe)) {
        return false;
    }
    *g_context.config = safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

bool saveConfigAndReply(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
        return false;
    }
    const bool ok = persistConfig(config);
    Esp32BaseWeb::sendJson(ok ? 200 : 500,
                           ok ? "{\"ok\":true,\"restartRecommended\":true}" : "{\"error\":\"save_failed\"}");
    return ok;
}

bool persistFilterConfig(const SystemConfig& config, std::size_t index) {
    if (!g_context.app->canApplyConfig() || index >= kFilterCount) {
        return false;
    }

    SystemConfig safe = config;
    sanitizeConfig(safe);

    FilterRecord runtime[kFilterCount]{};
    const FilterRecord* current = g_context.filters->records();
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        runtime[i] = current[i];
    }
    runtime[index] = safe.filters[index];

    if (!g_context.configStore->saveSystemConfig(safe) || !g_context.configStore->saveFilterRuntime(runtime)) {
        return false;
    }
    if (!g_context.filters->updateFilter(index, safe.filters[index]) || !g_context.app->applyConfig(safe)) {
        return false;
    }
    *g_context.config = safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    char json[256]{};
    sendJsonBuffer(writeStatusJson(g_context.app->snapshot(), json, sizeof(json)), json);
}

void handleConfigApi() {
    if (!Esp32BaseWeb::checkAuth() || !requireContext()) {
        return;
    }
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        if (!g_context.app->canApplyConfig()) {
            Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
            return;
        }
        SystemConfig candidate = *g_context.config;
        applyU32Param("confirmTimeoutSec", candidate.confirmTimeoutSec);
        applyU32Param("maxOutTimeSec", candidate.maxOutTimeSec);
        applyU32Param("maxOutVolumeMl", candidate.maxOutVolumeMl);
        applyU32Param("noFlowTimeoutSec", candidate.noFlowTimeoutSec);
        applyU32Param("highFlowMlPerMin", candidate.highFlowMlPerMin);
        applyU32Param("highFlowDurationSec", candidate.highFlowDurationSec);
        applyU32Param("pauseTimeoutSec", candidate.pauseTimeoutSec);
        applyU32Param("valveFullPowerSec", candidate.valveFullPowerSec);
        applyU32Param("oledSleepSec", candidate.oledSleepSec);
        candidate.beepEnabled = Esp32BaseWeb::hasParam("beepEnabled");

        char text[24]{};
        std::uint32_t parsed = 0;
        if (getParam("overflowPercent", text, sizeof(text)) && parseU32(text, parsed)) {
            candidate.overflowPercent = static_cast<std::uint8_t>(parsed);
        }
        if (getParam("valveHoldDutyPercent", text, sizeof(text)) && parseU32(text, parsed)) {
            candidate.valveHoldDutyPercent = static_cast<std::uint8_t>(parsed);
        }
        saveConfigAndReply(candidate);
        return;
    }
    char json[640]{};
    sendJsonBuffer(writeConfigJson(*g_context.config, json, sizeof(json)), json);
}

